{"id":371,"date":"2018-12-23T10:50:52","date_gmt":"2018-12-23T10:50:52","guid":{"rendered":"https:\/\/casinotik.club\/3\/?p=371"},"modified":"2020-09-07T20:01:03","modified_gmt":"2020-09-07T20:01:03","slug":"the-importance-of-penetration-testing-for-your-corporate-cybersecurity","status":"publish","type":"post","link":"https:\/\/smcauditors.com\/the-importance-of-penetration-testing-for-your-corporate-cybersecurity\/","title":{"rendered":"THE IMPORTANCE OF PENETRATION TESTING FOR YOUR CORPORATE CYBERSECURITY"},"content":{"rendered":"\r\n<p>Cybersecurity has become a primary issue for practically every company these days. Organizations unacquainted with cyber-attacks and the harm it can cause fall prey to these attacks consistently. Accordingly, the most appropriate way for an organization to secure itself is to focus on proactive and comprehensive security testing techniques. The most effective testing approach to measure current security practices is known as penetration testing, also called “Pen-testing”.<\/p>\r\n\r\n\r\n\r\n<h2>What is Pentesting?<\/h2>\r\n\r\n\r\n\r\n<p>This method of assessing cybersecurity involves the use of various manual and automated techniques to simulate an attack on an organization’s IT systems. It should be conducted by a qualified and independent expert, sometimes referred to as an “ethical security tester”. The goal of pen-testing is to try and exploit known vulnerabilities as well as leverage the expertise of the tester to identify other weaknesses and unknown vulnerabilities in an organization’s security arrangements. This method of testing involves an active analysis of the target system for any potential vulnerabilities that could result from poor or improper system configuration, known and unknown hardware or software flaws as well as operational weaknesses in system processes. This analysis is typically carried out from the position of a potential attacker and can involve active exploitation of security vulnerabilities.<\/p>\r\n\r\n\r\n\r\n<p>A Penetration Test is typically an assessment of IT infrastructure, networks, and business applications to identify attack vectors, vulnerabilities, and control weaknesses. The two most common forms of penetration testing are:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>Application penetration testing (typically web applications), which finds technical vulnerabilities;<\/li>\r\n<li>Infrastructure penetration testing, which examines servers, firewalls, and other hardware for security vulnerabilities.<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<h2>Limitations<\/h2>\r\n\r\n\r\n\r\n<ul>\r\n<li>Only covers the target application, infrastructure, or environment that has been selected.<\/li>\r\n<li>Focuses on exposures in technical infrastructure, it is not intended to cover all the ways in which critical or sensitive information can leak from an organization.<\/li>\r\n<li>Plays only a small part (despite often including social engineering tests) in reviewing the role of the individual (often the most important element of an organization’s defense system).<\/li>\r\n<li>Is only a snapshot of a system at a point in time.<\/li>\r\n<li>Can be limited by legal or commercial considerations, limiting the breadth or depth of a test.<\/li>\r\n<li>May not uncover all security weaknesses, for example, due to a restricted scope or inadequate testing.<\/li>\r\n<li>It provides results that are often technical in nature and need to be interpreted in a business context.<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<h2>Your penetration testing program should align within:<\/h2>\r\n\r\n\r\n\r\n<ul>\r\n<li>A wider security review framework (eg. ISO 27001, NIST cybersecurity framework, ISF Standard of Good Practice);<\/li>\r\n<li>Technical security infrastructure (including on-going security monitoring, vulnerability assessment, malware protection, and patch management);<\/li>\r\n<li>System development processes (particularly for Web applications).<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<h2>Your penetration testing program should be:<\/h2>\r\n\r\n\r\n\r\n<ul>\r\n<li>Approved by appropriate business and IT management.<\/li>\r\n<li>Supported by stated objectives and timelines.<\/li>\r\n<li>Integrated into your underlying technical security assurance framework.<\/li>\r\n<li>Reviewed regularly and kept up to date.<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<h2>The scope of your penetration testing program should:<\/h2>\r\n\r\n\r\n\r\n<ul>\r\n<li>Cover all main systems, enterprise-wide;<\/li>\r\n<li>Focus on critical systems;<\/li>\r\n<li>Allow for the protection of any sensitive information.<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<h2>Your penetration testing program should include:<\/h2>\r\n\r\n\r\n\r\n<ul>\r\n<li>A set of penetration testing processes and methodologies that apply enterprise-wide;<\/li>\r\n<li>Supplier selection criteria;<\/li>\r\n<li>A penetration testing assurance management framework;<\/li>\r\n<li>Follow up activities to ensure that remediation activities are carried out in an effective manner, reducing the risk of vulnerabilities being exploited in the future.<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<h2>Vulnerability assessment<\/h2>\r\n\r\n\r\n\r\n<p>A vulnerability assessment (sometimes referred to as ‘scanning’) is the use of automated tools to identify known common vulnerabilities in a system’s configuration. Vulnerability assessment tools scan the information system environment to establish whether security settings have been switched on and consistently applied – and that appropriate security patches have been deployed where required. Vulnerability assessments typically seek to validate the minimum level of security that should be applied and is often the precursor to more specialized penetration testing. It does not exploit the vulnerabilities identified to replicate a real attack, nor does it consider the overall security management processes and procedures that support the system. A penetration test is an ethical attack simulation that is intended to demonstrate or validate the effectiveness of security controls in a particular environment by highlighting risks posed by actual exploitable vulnerabilities. It is built around a manual testing process that is intended to go much further than the generic responses, false-positive findings, and lack of depth provided by automated application assessment tools (such as those used in a vulnerability assessment).<\/p>\r\n\r\n\r\n\r\n<h2>Pen-test requirements<\/h2>\r\n\r\n\r\n\r\n<p><strong>To get a certificate on CER.live, an exchange must prove that pentest complies with all necessary requirements. <\/strong>The final report must demonstrate that the company performed real penetration testing – this will prove the security of users’ funds and personal data. The list of requirements are:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>Pentest must be performed on the actual version of the infrastructure. If the infrastructure has a major update it must be retested.<\/li>\r\n<li>Testing must be performed on all components of the infrastructure.<\/li>\r\n<li>Testing must be performed on production, not staging, or developers’ versions.<\/li>\r\n<li>Penetration testing reports must include information about performed testing actions and must include all findings.<\/li>\r\n<li>The company must demonstrate that all findings were fixed.<\/li>\r\n<li>The company which performs penetration testing must not be affiliated with the exchange and must not have any vested interests in successful compliance.<\/li>\r\n<\/ul>\r\n","protected":false},"excerpt":{"rendered":"<p>Cybersecurity has become a primary issue for practically every company these days. Organizations unacquainted with cyber-attacks and the harm it can cause fall prey to these attacks consistently. Accordingly, the most appropriate way for an organization to secure itself is to focus on proactive and comprehensive security testing techniques. The most effective testing approach to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":372,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"featured_image_src":{"landsacpe":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_p1aoUsaQ7olX0ZPwjqc7vA.png",700,381,false],"list":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_p1aoUsaQ7olX0ZPwjqc7vA-463x348.png",463,348,true],"medium":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_p1aoUsaQ7olX0ZPwjqc7vA-300x163.png",300,163,true],"full":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_p1aoUsaQ7olX0ZPwjqc7vA.png",700,381,false]},"_links":{"self":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/371"}],"collection":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/comments?post=371"}],"version-history":[{"count":2,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/371\/revisions"}],"predecessor-version":[{"id":379,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/371\/revisions\/379"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/media\/372"}],"wp:attachment":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/media?parent=371"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/categories?post=371"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/tags?post=371"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}