{"id":374,"date":"2019-10-01T14:45:30","date_gmt":"2019-10-01T14:45:30","guid":{"rendered":"https:\/\/casinotik.club\/3\/?p=374"},"modified":"2020-09-07T20:00:24","modified_gmt":"2020-09-07T20:00:24","slug":"the-4-blockchain-revolutions-which-brought-us-to-security-tokens","status":"publish","type":"post","link":"https:\/\/smcauditors.com\/the-4-blockchain-revolutions-which-brought-us-to-security-tokens\/","title":{"rendered":"The 4 Blockchain Revolutions Which Brought Us To Security Tokens"},"content":{"rendered":"\r\n<p id=\"5fb6\">STO stands for Security Token Offering; an elegant, complex, and infinitely promising new instrument for raising capital and distributing wealth. It’s piqued the interest of Wall Street players and is becoming particularly popular amongst more traditional issuers and investors, leading speculators to already proclaim 2020 as the “year of Security Tokens.”<\/p>\r\n\r\n<p id=\"7ceb\">Breathless fawning about the next new ‘blockchain’ phenomenon aside, STOs really are the biggest innovation in the world of securities, since securities were the biggest innovation in finance (credit the 13th century Venetians!). The potential scale is immense, with an estimated trillion-dollar securities tokenization market. Some evangelists even claim these securities could prove to be so efficient and popular that OTC markets and traditional stock exchanges might cease to exist as we know them, over the next decade.<\/p>\r\n\r\n<h1 id=\"1e47\">So, what are security tokens and what makes them so special?<\/h1>\r\n\r\n<p id=\"cc48\">Security tokens — also called tokenized securities — are tokens that behave like securities. <em>(Just in case you’re starting at the ground floor, securities are financial assets, like stocks, bonds, investment contracts, etc., that hold some type of monetary value.)<\/em> They can provide a range of financial rights to an investor, such as equity, or a share in the profits of an underlying business, which are coded into a smart contract on a blockchain.<\/p>\r\n\r\n<p id=\"6388\">The genius of the emerging security token ecosystem lies in combining the traditional regulatory framework for securities with the core efficiencies of blockchain. The result? A securities market with increased liquidity, lower costs, fractionalization of larger assets and greater market efficiency. Many companies and institutions are actively developing infrastructures for issuing security tokens, some with a goal of creating more inclusivity for enterprises which have not ordinarily been able to raise capital.<\/p>\r\n\r\n<p id=\"2c58\">Security tokens find favor with institutional investors for their recognizable structure, and with crypto investors for their technological innovations. All in all, growing the entire securities market.<\/p>\r\n\r\n<p id=\"cd1f\">Tokenizing securities means lowering costs for issuers, but also improving efficiency for automated traders and intelligent trading assistants. When revenue streams or lock-out periods are managed using blockchain technology (instead of paper), the mundane can become incredible. What was once static and cost-prohibitive, is now fluid and cost-effective.<\/p>\r\n\r\n<p id=\"9146\">To truly understand the marvel that is securities tokens, it’s essential to understand how we got here — to recognize the four separate blockchain revolutions that made tokenized securities possible.<\/p>\r\n\r\n<h1 id=\"d4ea\"><strong>How bitcoin pizza paved the way for security tokens<\/strong><\/h1>\r\n\r\n<p id=\"99e4\">A common misconception among those just starting to learn about blockchain technology is that it is only a “distributed ledger” useful for facilitating transactions of a cryptocurrency. Bitcoin is to blame (or credit?). As the most widely-known cryptocurrency, and one that was first to introduce the “blockchain” system to maintain ownership records, Bitcoin is often where people start when they try to understand the concept of blockchain.<\/p>\r\n\r\n<p id=\"f6c8\">We won’t go into how Bitcoin builds on blockchain technology (here’s a great primer) but Bitcoin, and more specifically <strong>the distributed ledger technology it implemented, was the first Blockchain Revolution. <\/strong>It solved the problem of exclusively controlling a digital asset without an intermediary. If anyone needs a working proof of this ‘holy grail’ solution, they only need to look at the last 10 years and the people and businesses that have used Bitcoin.<\/p>\r\n\r\n<p id=\"d408\"><strong>Smart Contracts were the second Blockchain Revolution<\/strong>. The term and idea was proposed by Nick Szabo in 1994, but it took until 2014 for Bitcoin-enthusiast Vitalik Buterin and the other founding members of today’s second largest cryptocurrency, Ethereum, to make it a reality. Smart contracts are really just software code that includes certain terms, trigger events or dates, etc to automatically implement agreements. All parties can publicly and freely verify the details of the smart contract, and once the terms of the agreement are met, the contract automatically reconciles — all without an intermediary.<\/p>\r\n\r\n<p id=\"a38e\">The Ethereum team made this possible by, essentially, expanding what computers could be tasked with, beyond recording transactions, as they mined Ether on the Ethereum blockchain. Anyone with the necessary permissions and amount of Ether can initiate or interact with a smart contract by sending a transaction to the address where it’s stored on the Ethereum blockchain.<\/p>\r\n\r\n<p id=\"33df\">One popular use of smart contracts is the creation of <strong>Tokens, the third Blockchain Revolution.<\/strong> On the Ethereum blockchain, for instance, any user with the prerequisite amount of Ether can initiate an “ERC-20” smart contract (even users who can’t program), which in effect mints programmable ERC-20 tokens that are totally unique to that smart contact, and can be traded with other users on the Ethereum blockchain.<\/p>\r\n\r\n<p id=\"73bb\">Tokens are a fungible, irreproducible digital asset stored on a blockchain whose ownership can be maintained with 3rd party wallet applications (by users) or with proprietary software (by businesses and exchanges). Tokens, whether ERC-20 or others on different blockchains (such as the Waves platform) are the tools which allowed for <strong>the fourth Blockchain Revolution: Token Sales<\/strong> — Generating and selling tokens in exchange for cryptocurrency.<\/p>\r\n\r\n<p id=\"ef9d\">As part of this fourth revolution, entrepreneurs and startups sold dizzying amounts of tokens — More than 1700 token sales collected over $15 billion — since the beginning of 2017. Along with this success came scams and busts, and starting in 2017, the US Securities and Exchange Commission (SEC) began to push for regulation and give guidance on when token sales involving US citizens are really securities offerings.<\/p>\r\n\r\n<p id=\"6a74\">Which brings us to Securities Tokens.<\/p>\r\n\r\n<h1 id=\"6fc1\">From Token Sales to STOs<\/h1>\r\n\r\n<p id=\"47b4\"><strong>Security Tokens use much of the same blockchain infrastructure as Token Sales, but are sold and designed with compliance in mind. <\/strong>This entails following legal restrictions for sales, and in many cases, working with a broker-dealer.<\/p>\r\n\r\n<p id=\"91bf\">The thing to note with the coming STO ‘revolution’ is that it isn’t so much about the technical innovations as it is about the efficiency gains — by removing middlemen, executing deals faster and automating service functions. All of this is bolstered by the same technical infrastructure and industry that has given us the last four blockchain revolutions.<\/p>\r\n\r\n<p id=\"4d95\">STOs could someday see the same kind of growth that occurred for token sales in 2017, and perhaps even more. As stupefying as token sales were in 2017, they were only a fraction of the incumbent financial markets. To understand the potential of Security Token Offerings, consider this example — In the real estate industry alone, there are over $1 trillion in financial assets whose ownership could be managed using Security Tokens.<\/p>\r\n\r\n<p id=\"126e\">Every industry has a use for tokenized securities, whether to fund new ventures or manage ownership of existing ones; or, they can be used to test entirely new business models. The public sector might one day use security tokens to issue state, provincial, or federal municipal bonds; central banks could tokenize their national debt offerings. The writing on the block is clear — The future of securities, undeniably, lies within tokenization.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>STO stands for Security Token Offering; an elegant, complex, and infinitely promising new instrument for raising capital and distributing wealth. It’s piqued the interest of Wall Street players and is becoming particularly popular amongst more traditional issuers and investors, leading speculators to already proclaim 2020 as the “year of Security Tokens.” Breathless fawning about the next [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":375,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"featured_image_src":{"landsacpe":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/0_i-VQxsEtJGpMtkI_.jpg",700,422,false],"list":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/0_i-VQxsEtJGpMtkI_-463x348.jpg",463,348,true],"medium":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/0_i-VQxsEtJGpMtkI_-300x181.jpg",300,181,true],"full":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/0_i-VQxsEtJGpMtkI_.jpg",700,422,false]},"_links":{"self":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/374"}],"collection":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/comments?post=374"}],"version-history":[{"count":1,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/374\/revisions"}],"predecessor-version":[{"id":378,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/374\/revisions\/378"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/media\/375"}],"wp:attachment":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/media?parent=374"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/categories?post=374"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/tags?post=374"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}