{"id":380,"date":"2019-11-15T19:25:23","date_gmt":"2019-11-15T19:25:23","guid":{"rendered":"https:\/\/casinotik.club\/3\/?p=380"},"modified":"2020-09-07T19:59:53","modified_gmt":"2020-09-07T19:59:53","slug":"security-tokens-a-century-in-the-making","status":"publish","type":"post","link":"https:\/\/smcauditors.com\/security-tokens-a-century-in-the-making\/","title":{"rendered":"Security Tokens: A Century in the Making"},"content":{"rendered":"\r\n<p id=\"215d\"><em>Security Tokens are new tools for reducing costs while raising investment capital, and they present immediate opportunities for a broad variety of industries. In our previous article in this Security Token series, we introduced Security Token Offerings as the culmination of blockchain technology, token sales, and the traditional US securities regulatory framework. In this article, we look through history at a catastrophic financial period to understand why a securities compliant token represents both consumer protection and opportunity.<\/em><\/p>\r\n\r\n\r\n<hr class=\"wp-block-separator\" \/>\r\n\r\n\r\n<blockquote class=\"wp-block-quote\">Blockchain technology might be in its “90s internet phase” but the token market is definitely more like the ‘roaring 20s’.<\/blockquote>\r\n\r\n<p id=\"b155\">Innovation. Speculation. Pump-and-dump. Market Manipulation.<\/p>\r\n\r\n<p id=\"250a\">If you think we’re talking about the ‘the great ICO craze’ of 2017, take pause. The ‘roaring 1920s’ are what first gave meaning to many of these terms. The economy grew 42 percent during that decade. The number of shares traded per day doubled to 5 million. Get-rich-quick schemes had everyone’s attention and wealth and excess were the way of life.<\/p>\r\n\r\n<p id=\"2716\">And then came ‘Black Tuesday’, October 29, 1929—the Dow Jones Industrial Average fell 12 percent and share prices on the New York Stock Exchange completely collapsed, driving the country into the Great Depression. It was a spectacular fail, made possible only because the stock market had grown so irrationally (at 20 percent annually!) in the several years before. This financial bubble did not occur without reason, nor without plenty of warnings. Even president Herbert Hoover, while serving as Secretary of commerce in 1925, “noted the ‘growing tide of speculation’ in the stock market of that era.”<\/p>\r\n\r\n<p id=\"23ca\">Hoover went on to serve as president during the Great Depression, and he bore much of the public’s blame; but no one person can cause an economic collapse of this scale. It takes systemic failures by the government and banking industry, for sure, but also by companies, media organizations, and investors. In other words, everybody.<\/p>\r\n\r\n<h2 id=\"5bd8\">Innovation. Manipulation. Misinformation.<\/h2>\r\n\r\n<p id=\"fa15\">One contributing factor to the unbridled growth of the stock market leading up to Black Tuesday was innovation — both in technology, and in finance. Advancements in generating electricity, as well as in macromolecular chemistry, were used to radically increase manufacturing output throughout the 1920s. The stock brokers working during this time had their own breakthrough: allowing customers to buy on margin.<\/p>\r\n\r\n<p id=\"0af7\">All of a sudden, individual investors were given the option to borrow and invest ~700% more than they actually had. Plus, they had the luxury of investing in a market which, they were told, “had reached a permanently high plateau.” People from all walks of life were investing on margin in the stock market during what became known as the “Roaring Twenties.”<\/p>\r\n\r\n<p id=\"a348\">The stocks they were investing in, congressional hearings later found, were heavily manipulated, a second contributing factor for the boom and bust. A rampant form of manipulation during this time involved groups called “stock pools”. A group of wealthy investors and or stock brokers would cultivate a following of less-informed traders, then use that “pool” to perform schemes like a “Pump-and-dump.”<\/p>\r\n\r\n<p id=\"9e67\">A third contributing factor to the Big Crash was inadequate technology and regulations for banks and exchanges. For instance, checks were being counted as reserves before clearing, so funds were double-counted. There were also some companies which provided incomplete and misleading financial statements.<\/p>\r\n\r\n<p id=\"d87f\">In a perfect world, financial documents would be complete and truthful; but in the 1920s, it was nearly impossible for an investor to tell whether the reports they were receiving from their investments were complete and true, because there were no standards. Following the crash in 1929, these inaccuracies in financial reporting and organized manipulation of the stock markets were investigated by Congress, and those hearings showed widespread, organized fraud and misinformation occurring in the stock market which had come to be synonymous with the American success story.<\/p>\r\n\r\n<p id=\"34af\">This story led to Congress enacting new securities laws (including the Securities Act of 1933 and the Securities Exchange Act of 1934) to protect the world economy, as well as US investors. A key theme of these laws was information—To require companies and stock brokers to provide accurate information. This ensured that investors would have the data they needed to make informed investment choices. These new securities regulations were also made to help ensure that companies and individuals could be held responsible if they broke laws against the types of manipulation and fraud which contributed to the financial crisis in 1929.<\/p>\r\n\r\n\r\n<hr class=\"wp-block-separator\" \/>\r\n\r\n\r\n<p id=\"7616\">If you’ve had a building sense of foreboding through our little history lesson, you’re not very far off the mark. The Token Market over the last year has resembled the exuberant stock market of the 20s. The heady mix of innovation, manipulation and misinformation at the heart of ‘Black Tuesday’, in some way, exists today. The double-digit returns for some early contributors involved in token sales has led to many others having stars (or “to the Moon”) in their eyes.<\/p>\r\n\r\n<p id=\"d7a5\">Meanwhile, Market regulators like the SEC, CFTC and other agencies are increasingly examining how to oversee the markets for digital tokens. Multiple agencies have issued warnings relating to token sales, describing many of the same schemes and forms of manipulation that the Securities laws attempted to address, such as pump-and-dumps. In addition to manipulation, there is concern that not all token projects are fulfilling the goals they describe in their whitepapers, as revealed in a paper titled “Coin-Operated Capitalism.”<\/p>\r\n\r\n<p id=\"58d1\">Those who call themselves “cryptocurrency investors” might have more tolerance for risk and huge crashes like in 1929—several have already occurred for Bitcoin. Other crypto-entrepreneurs and token projects view regulators’ warnings about token sales and their attempts to regulate the space as a move to stifle innovation and free markets.<\/p>\r\n\r\n<p id=\"dc9c\">But, consider just how much these markets resemble the 1920s and just how many everyday folks bought into token sales and cryptocurrency at the peak of the bull run in December 2017. CFTC, SEC, FINRA, NFA, and other financial regulators are charged with protecting markets. If these problems are left unaddressed, we very well might have a day like Black Tuesday in our future.<\/p>\r\n\r\n<h2 id=\"9f23\">Enter Security Tokens<\/h2>\r\n\r\n<p id=\"cc60\">Security Token Offerings, in contrast to most token sales which have occurred, are sold in accordance with securities regulations (such as Regulation A+, CF or D ) . However, many of these STOs can only be offered to accredited investors. Because of this, a few companies that have issued STOs have received negative comments from the token sales and cryptocurrency investing community.<\/p>\r\n\r\n<p id=\"948e\">For example, Sia Tech is a distributed file storage token project which issued an STO for their “Siafund” token, in conjunction with the creation of their network’s “Utility Token,” Siacoin. Because the sale of Siafund tokens was only available to accredited investors (using Regulation D exemptions), the cryptocurrency community-at-large, according to the blog CryptoGazette, “felt betrayed” by Sia’s “capitulating to the authorities.”<\/p>\r\n\r\n<p id=\"6bed\">Sia might have garnered some negative attention from the Crypto Gazette, but by deciding to design their token sale with compliance in mind, they may have ensured a better future for their business. Since they explicitly followed securities regulations and provided the necessary materials, such as their Private Placement Offering Memorandum, investors view their token as a regulation-compliant security, which in turn offers Sia some protection.<\/p>\r\n\r\n<p id=\"52d2\">Consider Ripple as being in an arguably less enviable alternative situation to Sia’s. Ripple has now been served with three class action lawsuits pertaining to their issuance of XRP, which some investors say constitutes an issuance of a security. The suits all generally claim that people bought XRP from Ripple expecting certain returns, and so they are suing Ripple on behalf of all purchasers of XRP for the lost profits.<\/p>\r\n\r\n<p id=\"6e1d\">These are legal suits which, arguably, Sia’s STO is less susceptible to, because they proactively designed their sale to comply with existing regulations. Instead, Ripple is embroiled in claiming that their sale “doesn’t meet the standards” for a security, and so have hired a, presumably expensive, legal team (including former SEC chair Mary Jo White) to defend themselves.<\/p>\r\n\r\n<p id=\"5296\">How these suits facing Ripple (as well as other similar cases) progress in the next few years is anybody’s guess. But one thing is clear—More clarity over when an asset is considered a security by the SEC is needed by the community, investors and issuers alike. At a recent public hearing by the House Committee on Agriculture, Chairman K. Michael Conway opened by saying:<\/p>\r\n\r\n<blockquote class=\"wp-block-quote\">“Perhaps no question has generated greater uncertainty than how to determine if a particular token is a security…Congress and regulators may want to consider developing a new framework that takes into account the diverse characteristics and unique economic relationships embedded in the many types of digital assets that can be represented by tokens.”<\/blockquote>\r\n\r\n<p id=\"73a4\">As the story of the roaring 20’s (and the subsequent crash) illustrated though, making major revisions to laws on how investment capital is raised takes time. For token projects wishing to raise investment capital in the United States in the immediate future, Security Token Offerings are the prudent path. And that might very well be what keeps us away from the brink of a second ‘Black Tuesday’, at least in the near future.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>Security Tokens are new tools for reducing costs while raising investment capital, and they present immediate opportunities for a broad variety of industries. In our previous article in this Security Token series, we introduced Security Token Offerings as the culmination of blockchain technology, token sales, and the traditional US securities regulatory framework. In this article, we look [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":376,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"featured_image_src":{"landsacpe":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_qoCn9t_oRXEXz86pV0zLoA-700x445.jpeg",700,445,true],"list":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_qoCn9t_oRXEXz86pV0zLoA-463x348.jpeg",463,348,true],"medium":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_qoCn9t_oRXEXz86pV0zLoA-300x200.jpeg",300,200,true],"full":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_qoCn9t_oRXEXz86pV0zLoA.jpeg",700,466,false]},"_links":{"self":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/380"}],"collection":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/comments?post=380"}],"version-history":[{"count":1,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/380\/revisions"}],"predecessor-version":[{"id":381,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/380\/revisions\/381"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/media\/376"}],"wp:attachment":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/media?parent=380"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/categories?post=380"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/tags?post=380"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}