{"id":382,"date":"2020-06-01T12:56:07","date_gmt":"2020-06-01T12:56:07","guid":{"rendered":"https:\/\/casinotik.club\/3\/?p=382"},"modified":"2020-09-07T19:59:45","modified_gmt":"2020-09-07T19:59:45","slug":"tokenize-securities-why-bother","status":"publish","type":"post","link":"https:\/\/smcauditors.com\/tokenize-securities-why-bother\/","title":{"rendered":"Tokenize Securities? Why Bother"},"content":{"rendered":"\r\n<p id=\"80b0\">What could possibly justify the hype and asset bubble surrounding cryptographic assets? Some believe crypto signals a shift in technological and economic paradigms, and a new industrial era. So: we had the ages of Steam, Steel, Petroleum, Information, and now…Crypto? Joel Monegro and Chris Burniske have argued as much in their thesis for Placeholder Ventures. I’ve questioned that analysis — not based on the technology’s history-changing potential — but instead, looking at its timing. In other words, is it 1994, when Netscape was founded? Or, is it 1976, when the first microcomputer operating system was introduced?<\/p>\r\n\r\n<p id=\"d5b4\">Even greater skepticism is warranted for so-called “security tokens.” At New Alchemy, the question we ask is, “Why does this token need to exist?” <strong>So, why do security tokens need to exist? <\/strong>There are several reasons.<\/p>\r\n\r\n<p id=\"383a\">First of all, it will be helpful to stop calling them “security tokens.” <mark>These so-called security tokens are smart contracts that function as financial instruments: they may convey the same rights that come with ownership, for example, as a stock certificate or a bond may do.<\/mark> The Brooklyn Project, a financial data provider in crypto assets, is right to point out that the term “security token” is really only useful in the context of US securities law, which may not apply to all these instruments. The term, “Investment Token,” which the Brooklyn Project has put forward, is better, but we prefer “financial token.” These are financial instruments that may convey various forms of ownership, including direct, indirect, and shared ownership. “Investment” is likely to be apt in most cases, but it may not always be the best term to use.<\/p>\r\n\r\n<p id=\"adaf\">So, why bother with financial tokens? The existing set-up for investing in securities and trading them seems to work pretty well. There are two primary reasons:<\/p>\r\n\r\n<h2 id=\"19ee\"><strong>Liquidity:<\/strong><\/h2>\r\n\r\n<p id=\"c494\">Investors who buy private equity shares in a startup or a growing company often expect to wait up to 10 years to exchange those shares for cash or publicly traded stock. As appetite for private equity has grown, that timeline has grown, too: Successful firms tap private equity markets for capital in late stages that once would have been financed through an IPO. With those longer waits to liquidity, secondary markets have emerged, supporting trade in privately held companies. Tokenization could support a much more liquid and efficient secondary market. Securities law permits investment contracts sold pursuant to the Regulation D exemption to be traded with unaccredited investors under certain circumstances, after a 12-month holding period. Efforts are under way to set up a secondary market for financial tokens when they may become tradable and investors may be willing to waive some of the liquidity premium they’d otherwise demand, in anticipation that those efforts will bear fruit.<\/p>\r\n\r\n<h2 id=\"c022\"><strong>Fractional Ownership:<\/strong><\/h2>\r\n\r\n<p id=\"9f95\">Simply put, tokens hold out the promise of supporting many owners for a single asset, where before it was practical only to have one. Examples include:<\/p>\r\n\r\n<ul>\r\n \t<li>a single piece of real estate<\/li>\r\n \t<li>a single share in an OTC-listed company (shares are decimalized on the big board, but not on OTC markets)<\/li>\r\n \t<li>a single line of business or balance-sheet asset inside a larger company<\/li>\r\n<\/ul>\r\n\r\n<p id=\"65e2\">Mechanisms exist today to accomplish some of these forms of fractionalization, but none are efficient enough to be widely used.<\/p>\r\n\r\n<p id=\"084c\">New Alchemy believes the greatest potential may be in real estate, as a fractional form of access to real estate investing that is more nimble and less costly than a REIT. We are close to launching a real estate portfolio strategy that has been a long time and a great deal of study in the making.<\/p>\r\n\r\n<p id=\"008a\">You may have heard people talking about going “long Manhattan and short Brooklyn.” This is a possibility, but shorting an asset implies margin. With mere liquidity in the realm of potential, margin seems a long way off. In our view, tokenization will make wealth available to a broader set of investors by reducing expenses and increasing liquidity. The long-term effect, driven by these factors, will likely include the ability to parse assets that were once monolithic: investing in the iPhone, but not the Apple Watch, for example — or, indeed, Manhattan but not Brooklyn.<\/p>\r\n\r\n\r\n<hr class=\"wp-block-separator\" \/>\r\n\r\n\r\n<p id=\"c1ac\">There are other advantages, but none so compelling as liquidity and fractionalization. For example, tokenization may reduce the time and costs associated with clearance, settlement, reporting and compliance. They can efficiently provide distributions on a monthly basis (or other timing tied specifically to the revenue source), rather than the semi-annual cadence typical of bond offerings. They may be interoperable, enabling asset-for-asset exchange rates and trades, rather than trading through a currency.<\/p>\r\n\r\n<p id=\"47db\">Ultimately, even increasing liquidity is an incremental innovation. It is likely to bring in new assets in the thousands and capital in the trillions. But it’s simply a more efficient way to do what a large portion of the world is already doing.<\/p>\r\n\r\n<p id=\"a58d\">Having worked on successful projects in the first wave of widespread crypto-asset issuance, we’re aware at New Alchemy that there is a more disruptive opportunity. Decentralized networks, supported by blockchain-based consensus and a cryptographic asset that sets incentives, represent a new way to organize people, information and capital. The assets themselves represent a new form of value capture. Warren Buffett’s moats do indeed start to look Medieval.<\/p>\r\n\r\n<p id=\"6d36\">But history shows that whenever a new technology paradigm comes along, existing industries also benefit. Manufacturers of trains and ships adopted Henry Ford’s assembly line. Oil and gas companies are beginning to use Google’s enterprise data services.<\/p>\r\n\r\n<p id=\"0862\">The same thing is beginning to happen with blockchain technology, as legacy systems adopt some of the technology and features of the new paradigm. Such projects may in some cases be moving beyond window-dressing and PR stunts, and into the realm of practical application. Oracle, for example, has taken its efficiency-focused blockchain offering past its pilot stage with a handful of customers in supply chain logistics and in banking back-office operations.<\/p>\r\n\r\n<p id=\"7ead\">Soon, many companies will begin to use blockchain technology in a more universal way: to raise capital. This will not be a so-called “disruptive” innovation. For-profit corporations issuing stocks and bonds, funds investing in real estate and alternative assets — these entities are unlikely to embrace decentralization. Nonetheless, at New Alchemy, we believe it will be a multi-trillion-dollar opportunity, as both emerging asset classes and existing asset classes trade in more liquid and efficient markets. We concur with US broker-dealer David Weild, and others, who have suggested that tokenization may bring back micro- and even so-called nano-cap stock issuance that has fled the US market. Many issuers will embrace tokenization, and we’re working to provide the technology and knowhow that make it profitable for them to do so.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>What could possibly justify the hype and asset bubble surrounding cryptographic assets? Some believe crypto signals a shift in technological and economic paradigms, and a new industrial era. So: we had the ages of Steam, Steel, Petroleum, Information, and now…Crypto? Joel Monegro and Chris Burniske have argued as much in their thesis for Placeholder Ventures. I’ve questioned that analysis — not based [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":377,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"featured_image_src":{"landsacpe":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_aObS-OVMpO2joIx5hv5TiA-700x445.png",700,445,true],"list":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_aObS-OVMpO2joIx5hv5TiA-463x348.png",463,348,true],"medium":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_aObS-OVMpO2joIx5hv5TiA-300x206.png",300,206,true],"full":["https:\/\/smcauditors.com\/onoaltee\/2020\/09\/1_aObS-OVMpO2joIx5hv5TiA.png",700,480,false]},"_links":{"self":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/382"}],"collection":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/comments?post=382"}],"version-history":[{"count":1,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/382\/revisions"}],"predecessor-version":[{"id":383,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/posts\/382\/revisions\/383"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/media\/377"}],"wp:attachment":[{"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/media?parent=382"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/categories?post=382"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/smcauditors.com\/wp-json\/wp\/v2\/tags?post=382"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}